app/Controllers/Company/CompanyController.php

SELECT *
FROM `Company`
WHERE `c_id` = '2'
 LIMIT 1
---
    public function UpdateCompany()
    {
        $isToken = check_jwt_authentication();
        if (!$isToken) {
            return $this->response->setJSON([
                "message" => "Authentication failed",
                "status" => "error"
            ]);
        }
        $id = $this->request->getVar('c_id');
        if (!$id) {
            return $this->response->setJSON([
                "status" => "error",
                "message" => "Company ID is required"
            ]);
        }

        $companyModel = new CompanyModel();
        $existingCompany = $companyModel->find($id);