app/Controllers/Company/CompanyController.php

SELECT COUNT(*) AS `numrows`
FROM `Company`
SELECT *
FROM `Company`
ORDER BY `c_id` DESC
SELECT *
FROM `plant`
ORDER BY `p_id` DESC
SELECT COUNT(*) AS `numrows`
FROM `plant`
---
    public function GetCompany()
    {
        try {

            $companyModel = new CompanyModel();
            $allCompany   = $companyModel->orderBy("c_id", "DESC")->findAll();
            $countcompany = $companyModel->countAllResults();

            $plantModel = new PlantModel();
            $allPlant   = $plantModel->orderBy("p_id", "DESC")->findAll();
            $countPlant = $plantModel->countAllResults();

SELECT *
FROM `Company`
WHERE `c_id` = '1'
 LIMIT 1
SELECT *
FROM `plant`
WHERE `c_id` = '1'
SELECT *
FROM `unit`
WHERE `u_plant_id` = '1'
SELECT *
FROM `customer`
WHERE `c_unit_id` = '1'
---
    public function fetchSingleCompany()
    {

        $isToken = check_jwt_authentication();
        if (! $isToken) {
            return $this->response->setJSON([
                "message" => "Authentication failed",
                "status"  => "error",
            ]);
        }

        try {
            $company_id     = $this->request->getVar('id');
            $companyModel   = new CompanyModel();
            $plantModel     = new PlantModel();
            $unitModel      = new UnitModel();
            $customerModel  = new CustomerModel();
            $quotationModel = new QuotationModel();
            $singleCompany  = $companyModel->where('c_id', $company_id)->first();

            $plantList    = $plantModel->where('c_id', $company_id)->findAll();
            $unitList     = [];
            $customerList = [];
            foreach ($plantList as $plant) {
                $unitDetails = $unitModel->where('u_plant_id', $plant['p_id'])->findAll();
                if ($unitDetails) {
                    foreach ($unitDetails as $unit) {
                        $unit['plant_name'] = $plant['p_city'];
                        $unitList[]         = $unit;
                        $customerDetails    = $customerModel->where('c_unit_id', $unit['u_id'])->findAll();