app/Controllers/Unit/UnitController.php

    public function GetUnit()
    {
        try {
            $unitModel    = new UnitModel();
            $companyModel = new CompanyModel();
            $plantModel   = new PlantModel();
            $allUnit      = $unitModel->orderBy("u_id", "DESC")->findAll();
            $countUnit    = $unitModel->countAllResults();
            $updatedArray = [];
            foreach ($allUnit as $unit) {
                $companyDetails = $companyModel->where('c_id', $unit['u_company_id'])->first();
                if ($companyDetails) {
                    $unit['companyDetails'] = $companyDetails;
                }

                $plantDetails = $plantModel->where('p_id', $unit['u_plant_id'])->first();
---
SELECT *
FROM `unit`
ORDER BY `u_id` DESC
SELECT COUNT(*) AS `numrows`
FROM `unit`
SELECT *
FROM `Company`
WHERE `c_id` = '1'
 LIMIT 1
SELECT *
FROM `plant`
WHERE `p_id` = '1'
 LIMIT 1