app/Controllers/Dashboard/DashboardController.php

SELECT *
FROM `customer`
ORDER BY `c_created_at` DESC
 LIMIT 5
SELECT *
FROM `product`
ORDER BY `p_created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `c_status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `c_status` = 'inactive'
SELECT COUNT(*) AS `numrows`
FROM `product`
WHERE `p_status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `product`
WHERE `p_status` = 'inactive'
---
    public function fetchDashboardDetails()
    {
        $customerModel = new CustomerModel();
        $productModel = new ProductModel();

        try {

            $customerList = $customerModel->orderBy('c_created_at', 'DESC')->findAll(5, 0);
            $productList = $productModel->orderBy('p_created_at', 'DESC')->findAll(5,0);


            $activeCustomers = $customerModel->where('c_status', 'active')->countAllResults();
            $inactiveCustomers = $customerModel->where('c_status', 'inactive')->countAllResults();


            $activeProducts = $productModel->where('p_status', 'active')->countAllResults();
            $inactiveProducts = $productModel->where('p_status', 'inactive')->countAllResults();