app/Helpers/auth_helper.php

SELECT *
FROM `employee`
WHERE `emp_username` = 'abhisharma'
AND `emp_password` = 'MTIzNDU2'
 LIMIT 1
---
    function employee_login($username, $password) {

        $employeeModel = new EmployeModel();

        $employee = $employeeModel->where('emp_username', $username)->where('emp_password', base64_encode($password))->first();

INSERT INTO `login_activity` (`la_type`, `la_user_id`, `la_ip_address`, `la_agent`, `la_add_information`, `la_lat_long`) VALUES ('employee', '1', '', '', 'working', ',')
---
    function login_time_record($type, $id, $ipaddress, $agent = '', $addInformation = '', $lat_long = '') {

        $la_data = [
            "la_type" => $type,
            "la_user_id" => $id,
            "la_ip_address" => $ipaddress,
            "la_agent" => $agent,
            "la_add_information" => $addInformation,
            "la_lat_long" => $lat_long
        ];

        $loginActivityModel = new LoginActivityModel();

        $insertLoginActivity = $loginActivityModel->insert($la_data);