app/Controllers/Quotation/QuotationController.php

    public function fetchQuotation()
    {
        $QuotationModel = new QuotationModel();

        try {

            $page = $this->request->getGet("page") ?? 1;
            $page = ($page * 20) - 20;

            $search = $this->request->getGet("search") ?? "";

            // $allQuotation = $QuotationModel->findAll();
            $allQuotation = $QuotationModel->orderBy("quo_id", "DESC")->like("quo_name", $search)->findAll(20, $page);
            $countQuotation = $QuotationModel->like("quo_name", $search)->countAllResults();
---
SELECT *
FROM `quotation`
WHERE `quo_name` LIKE '%%' ESCAPE '!'
ORDER BY `quo_id` DESC
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `quotation`
WHERE `quo_name` LIKE '%%' ESCAPE '!'