app/Controllers/Authentication/LoginController.php

    public function crmLogin()
    {

        $username = $this->request->getPost('username') ?? "";
        $password = $this->request->getPost('password') ?? "";


        if ($username == '' || $password == '') {
            return $this->response->setJSON([
                "status" => false,
                "message" => "Enter username number or password",
                "data" => (object) [],
            ]);
        }

        $userModel = new UserModel();

        try {
            $user = $userModel->where(['user_name' => $username, 'user_pass' => hash('sha256', $password)])->first();
---
SELECT *
FROM `user`
WHERE `user_name` = 'admin'
AND `user_pass` = '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92'
 LIMIT 1