app/Controllers/Authentication/LoginController.php

SELECT *
FROM `user`
WHERE `user_name` = 'abhisharma'
AND `user_pass` = '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92'
 LIMIT 1
---
            $userModel = new UserModel();

            try {
                $user = $userModel->where(['user_name' => $username, 'user_pass' => hash('sha256', $password)])->first();