app/Controllers/LoginActivity/LoginActivityController.php

    public function individualLoginActivities() {

        $isToken = check_jwt_authentication();
        if (!$isToken) {
            return $this->response->setJSON([
                "message" => "Authentication failed",
                "status" => "error"
            ]);
        }

        $loginActivityModel = new LoginActivityModel();
        $employeeModel = new EmployeModel();

        $allLoginActivities = $loginActivityModel->where('la_type', 'employee')->where('la_user_id', $isToken->emp_id)->orderBy('la_id', 'desc')->findAll();

        $totalLoginActivities = [];

        foreach ($allLoginActivities as $log) {

            if($log['la_type'] == 'employee') {
                $singleEmployee = $employeeModel->where('emp_id', $log['la_user_id'])->first();
---
SELECT *
FROM `employee`
WHERE `emp_id` = '1'
 LIMIT 1