app/Controllers/Plant/PlantController.php

SELECT *
FROM `plant`
ORDER BY `p_id` DESC
SELECT COUNT(*) AS `numrows`
FROM `plant`
---
    public function GetPlant()
    {
        try {

            $plantModel = new PlantModel();
            $allPlant   = $plantModel->orderBy("p_id", "DESC")->findAll();
            $countPlant = $plantModel->countAllResults();